habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
} // END OF calculateSystemTemp



/********************************************************************************************************
* @brief Calculates the SYSTEM ± supply rail voltage.  The negative supply rail is inverted externally so it is
* read here as a positive value.  If the calling function is passing the negative supply rail FIFO it must
* also multiply the return value by -1.
*
* @author original: Hab Collector \n
*
* @note: External divider ratio of .110 (30V to 3.3V)
* @note: Divider ratio for ±20V is the same
* @note: Nominal supply voltage is 20V
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* @return As a positive number only the supply rail voltage
*
* STEP 1: Calculate the mean of the ADC Supply rail counts
* STEP 2: Using the mean value calculate supply rail according to input divider ratio
********************************************************************************************************/
static double calculateSystemSupply(Type_16b_FIFO *FIFO_SupplyRail)
{
    // STEP 1: Calculate the mean of the ADC Supply rail counts
    double MeanSupplyRailCount = 0.0;
    MeanSupplyRailCount = (double)((double)FIFO_SupplyRail->Sum / FIFO_SupplyRail->Depth);

    // STEP 2: Using the mean value calculate supply rail according to input divider ratio
    double SupplyRailVoltage = MeanSupplyRailCount * LSB_12BIT_VALUE * System_ADC_Reference * DIVIDER_20V_CONVERSION;
    return(SupplyRailVoltage);

} // END OF calculateSystemSupply



/********************************************************************************************************
* @brief Calculates the CHANNEL mean, max, min and RMS current.
*
* @author original: Hab Collector \n
*
* @note: TODO MORE NOTES
* @note: TODO MORE NOTES
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* @param ADC_AmpMonitorCount: ADC Count from ADC channel for the specific current monitor
* @param FIFO_AmpMon: FIFO structure associated with the specific Amp Monitor channel
* @param CurrentMeasure: ArbPwrBooster current measure struct associated with the specific channel
*
* STEP 1: Calculate the mean of the Current Monitor
* STEP 2: Calculate the instantaneous current
* STEP 3: Update Min current - If Min set to zero overwrite with present value
* STEP 4: Update Max current - if Max set to zero overwrite with present value
* STEP 5: Calculate the RMS current
********************************************************************************************************/
//uint16_t RMS_Value;
static void calculateChannelCurrent(double ADC_AmpMonitorCount, Type_16b_FIFO *FIFO_AmpMon, Type_ChannelMeasure *CurrentMeasure)
{
    // STEP 1: Calculate the mean of the Current Monitor
    double MeanCurrentCount = 0.0;
    MeanCurrentCount = FIFO_AmpMon->Sum / FIFO_AmpMon->Depth;
    CurrentMeasure->MeanCurrent = ((MeanCurrentCount * LSB_12BIT_VALUE * System_ADC_Reference) / AMP_MONITOR_GAIN) / AMP_SENSE_RESISTOR;

    // STEP 2: Calculate the instantaneous current
    double AmpMonitorCurrent = ((ADC_AmpMonitorCount * LSB_12BIT_VALUE * System_ADC_Reference) / AMP_MONITOR_GAIN) / AMP_SENSE_RESISTOR;

    // STEP 3: Update Min current - If Min set to zero overwrite with present value
    if (CurrentMeasure->MinCurrent == 0)
        CurrentMeasure->MinCurrent = AmpMonitorCurrent;
    else if (AmpMonitorCurrent < CurrentMeasure->MinCurrent)
        CurrentMeasure->MinCurrent = AmpMonitorCurrent;

    // STEP 4: Update Max current - if Max set to zero overwrite with present value
    if (CurrentMeasure->MaxCurrent == 0)
        CurrentMeasure->MaxCurrent = AmpMonitorCurrent;
    else if (AmpMonitorCurrent > CurrentMeasure->MaxCurrent)
        CurrentMeasure->MaxCurrent = AmpMonitorCurrent;

    // STEP 5: Calculate the RMS current
    CurrentMeasure->RMS_Current = CurrentMeasure->RMS_UpdateFunctionPointer(AmpMonitorCurrent);

}



static void calculateChannelVoltage(double ADC_VoltMonitorCount, Type_16b_FIFO *FIFO_VoltMon, Type_ChannelMeasure *VoltageMeasure)
{
    // STEP 1: Calculate the mean of the Voltage Monitor
    double MeanVoltageCount = 0.0;
    MeanVoltageCount = FIFO_VoltMon->Sum / FIFO_VoltMon->Depth;
    VoltageMeasure->MeanVoltage = MeanVoltageCount * LSB_12BIT_VALUE * System_ADC_Reference * DIVIDER_VOLT_MON_CONVERSION;

    // STEP 2: Calculate the instantaneous current
    double VoltMonitorVoltage = ADC_VoltMonitorCount * LSB_12BIT_VALUE * System_ADC_Reference * DIVIDER_VOLT_MON_CONVERSION;

    // STEP 3: Update Min current - If Min set to zero overwrite with present value
    if (VoltageMeasure->MinVoltage == 0)
        VoltageMeasure->MinVoltage = VoltMonitorVoltage;
    else if (VoltMonitorVoltage < VoltageMeasure->MinVoltage)
        VoltageMeasure->MinVoltage = VoltMonitorVoltage;

    // STEP 4: Update Max current - if Max set to zero overwrite with present value
    if (VoltageMeasure->MaxVoltage == 0)
        VoltageMeasure->MaxVoltage = VoltMonitorVoltage;
    else if (VoltMonitorVoltage > VoltageMeasure->MaxVoltage)
        VoltageMeasure->MaxVoltage = VoltMonitorVoltage;
}




/********************************************************************************************************
* @brief ADC1 is configured for DMA single shot conversion mode.  At the end of each conversion the ADC must
* be restarted for the next conversion.  Issue this command to start a conversion.  When the conversion is
* completed the results will be handled in HAL_ADC_ConvCpltCallback().
*
* @author original: Hab Collector \n
*
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* STEP 1: Start ADC 1 conversion all channels in single shot DMA mode
********************************************************************************************************/
void ADC1_StartConversion(void)
{
    // STEP 1: Start ADC 1 conversion all channels in single shot DMA mode
    HAL_ADC_Start_DMA(&hadc1, (uint32_t *)ADC1_CountValue, ADC1_NUMBER_OF_CHANNELS);

