habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
}  // END OF ADC1_StartConversion



/********************************************************************************************************
* @brief Checks the system values of +20V, -20V, Temperature and Vref to see if they are within the specified
* limits of operation.  All errors are OR together to the error variable, but only the first error description
* is returned.
*
* @author original: Hab Collector \n
*
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* STEP 1: Check System +20V
* STEP 2: Check System -20V
* STEP 3: Check System Vref
* STEP 4: Check System Temperature
* STEP 5: For no error
********************************************************************************************************/
bool systemMeasureWithinLimits(char *ErrorDescription, uint8_t *ErrorNumber)
{
    bool FirstErrorFound = false;
    *ErrorNumber = CONFIG_NO_ERROR;

    // STEP 1: Check System +20V
    if ((ArbPwrBooster.SystemMeasure.Positive_20V > POS_20V_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.Positive_20V < POS_20V_LOWER_LIMIT))
    {
        *ErrorNumber |= (1 << CONFIG_POS_20V_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "+20V: %3.1fV to %3.1fV", POS_20V_LOWER_LIMIT, POS_20V_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 2: Check System -20V
    if ((ArbPwrBooster.SystemMeasure.Negative_20V > NEG_20V_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.Negative_20V < NEG_20V_LOWER_LIMIT))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_NEG_20V_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "-20V: %3.1fV to %3.1fV", NEG_20V_LOWER_LIMIT, NEG_20V_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 3: Check System Vref
    if ((ArbPwrBooster.SystemMeasure.VDD_VDREF > SYSTEM_3V3_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.VDD_VDREF < SYSTEM_3V3_LOWER_LIMIT))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_VREF_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "VREF: %4.3fV to %4.3fV", SYSTEM_3V3_LOWER_LIMIT, SYSTEM_3V3_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 4: Check System Temperature
    if ((ArbPwrBooster.SystemMeasure.TempDegreeC > SYSTEM_TEMP_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.TempDegreeC < SYSTEM_TEMP_LOWER_LIMIT))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_TEMP_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "%dC < Temp < %dC", SYSTEM_TEMP_LOWER_LIMIT, SYSTEM_TEMP_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 5: For no error
    if (*ErrorNumber == CONFIG_NO_ERROR)
    {
        sprintf(ErrorDescription, "I'm good how about you.");
        return(true);
    }
    else
    {
        return(false);
    }

} // END OF systemMeasureWithinLimits




// RMS STUFF
// Circular buffer for storing recent ADC values
static double BufferWindow_CH1[RMS_WINDOW_SIZE] = {0};
// Function to update RMS in real-time
double update_CH1_RMS(double NewSampleValue)
{
    static int Index = 0;
    static int Count = 0;
    static double SumOfSquares = 0.0;

    double RMS_CurrentValue;
    // Remove the oldest value from sum_squares if buffer is full
    if (Count >= RMS_WINDOW_SIZE)
        SumOfSquares -= BufferWindow_CH1[Index] * BufferWindow_CH1[Index];  // Remove old squared value
    else
        Count++;

    // Store new value and update sum of squares
    BufferWindow_CH1[Index] = NewSampleValue;
    SumOfSquares += NewSampleValue * NewSampleValue;

    // Update RMS
    RMS_CurrentValue = sqrt(SumOfSquares / Count);

    // Move buffer index (circular)
    Index = (Index + 1) % RMS_WINDOW_SIZE;

    return(RMS_CurrentValue);
}


static double BufferWindow_CH2[RMS_WINDOW_SIZE] = {0};
double update_CH2_RMS(double NewSampleValue)
{
    static int Index = 0;
    static int Count = 0;
    static double SumOfSquares = 0.0;

    double RMS_CurrentValue;
    // Remove the oldest value from sum_squares if buffer is full
    if (Count >= RMS_WINDOW_SIZE)
        SumOfSquares -= BufferWindow_CH2[Index] * BufferWindow_CH2[Index];  // Remove old squared value
    else
        Count++;

    // Store new value and update sum of squares
    BufferWindow_CH2[Index] = NewSampleValue;
    SumOfSquares += NewSampleValue * NewSampleValue;

    // Update RMS
    RMS_CurrentValue = sqrt(SumOfSquares / Count);

    // Move buffer index (circular)
    Index = (Index + 1) % RMS_WINDOW_SIZE;

    return(RMS_CurrentValue);
}
